In [3]:
pip install pandas

Collecting pandas
  Using cached pandas-2.2.2-cp312-cp312-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (19 kB)
Collecting numpy>=1.26.0 (from pandas)
  Using cached numpy-2.0.0-cp312-cp312-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (60 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in /root/.local/share/virtualenvs/demo-devcontainer-main-3bA0MOTb/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2024.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2024.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /root/.local/share/virtualenvs/demo-devcontainer-main-3bA0MOTb/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Using cached pandas-2.2.2-cp312-cp312-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (12.7 MB)
Using cached numpy-2.0.0-cp312-cp312-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (19.0 MB)
Using cached pytz-2024.1-py2.py3-none-any.whl (505 kB)
Using cached tzdata-2024.1-py2.py3-none-any.whl (345 kB)
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-2.0.0 pandas-2.2.2 pytz-2024.1 tzdata-2024.1

[notice] A new release of pip is available: 24.1 -> 24.1.2
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame(columns=['Name', 'Age', 'Height'])
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [6]:
df.loc[0] = ['Allen', '22', '175']
df

    Name Age Height
0  Allen  22    175

In [7]:
df.loc[1] = ['Ted', 25, 180]
df.loc[2] = ['Ted', 28, 177]
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2    Ted  28    177

In [8]:
df['Age']

0    22
1    25
2    28
Name: Age, dtype: object

In [9]:
df["weight"] = [75, 80, 85]
df

    Name Age Height  weight
0  Allen  22    175      75
1    Ted  25    180      80
2    Ted  28    177      85

In [10]:
df['weight']

0    75
1    80
2    85
Name: weight, dtype: int64

In [11]:
df.drop(['weight'], axis=1)

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2    Ted  28    177

In [12]:
df

    Name Age Height  weight
0  Allen  22    175      75
1    Ted  25    180      80
2    Ted  28    177      85

In [13]:
df = df.drop(['weight'], axis=1)

In [14]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2    Ted  28    177

In [15]:
df.drop(2)

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [16]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2    Ted  28    177

In [17]:
df = df.drop(2)
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180

In [18]:
df['Height'] = [180, 185]
df

    Name Age  Height
0  Allen  22     180
1    Ted  25     185

In [20]:
df['Height'] = 190
df

    Name Age  Height
0  Allen  22     190
1    Ted  25     190

In [32]:
columns = ["Name", "Age", "Height"]
data = [
    ["Jake", 26, 180],
    ["Trump", 23, 185]
]

df2 = pd.DataFrame(
    data=data,
    columns=columns
)


df2

    Name  Age  Height
0   Jake   26     180
1  Trump   23     185

In [33]:
df_union = pd.concat([df, df2])
df_union

    Name Age  Height
0  Allen  22     190
1    Ted  25     190
0   Jake  26     180
1  Trump  23     185

In [35]:
df_union.reset_index()

   index   Name Age  Height
0      0  Allen  22     190
1      1    Ted  25     190
2      0   Jake  26     180
3      1  Trump  23     185

In [36]:
# 重設 index
df_union.reset_index(drop=True)

    Name Age  Height
0  Allen  22     190
1    Ted  25     190
2   Jake  26     180
3  Trump  23     185

In [38]:
df_union = df_union.reset_index(drop=True)
df_union

    Name Age  Height
0  Allen  22     190
1    Ted  25     190
2   Jake  26     180
3  Trump  23     185

In [40]:
# 不顯示 index 欄
df_union.to_csv('basic.csv', index=False)

In [41]:
# 不顯示標題列
df_union.to_csv('basic_no_columns.csv',
                index=False, header=None)

In [42]:
df

    Name Age  Height
0  Allen  22     190
1    Ted  25     190

In [43]:
df_replica = df

In [44]:
df['Age'] = 28
df

    Name  Age  Height
0  Allen   28     190
1    Ted   28     190

In [45]:
df_replica

    Name  Age  Height
0  Allen   28     190
1    Ted   28     190

In [46]:
# 備份
df_replica = df.copy()

In [47]:
df['Height'] = 180
df

    Name  Age  Height
0  Allen   28     180
1    Ted   28     180

In [48]:
df_replica

    Name  Age  Height
0  Allen   28     190
1    Ted   28     190